GreatCowBASIC/DATFileGenerator/incfiles/p18F46Q84.inc
;----- C1FLTOBJ1H Bits -----------------------------------------------------
SID0             EQU  H'0000'
SID1             EQU  H'0001'
SID2             EQU  H'0002'
EID0             EQU  H'0003'
EID1             EQU  H'0004'
EID2             EQU  H'0005'
EID3             EQU  H'0006'
EID4             EQU  H'0007'
SID8             EQU  H'0000'
SID9             EQU  H'0001'
SID10            EQU  H'0002'
EID0             EQU  H'0003'
EID1             EQU  H'0004'
EID2             EQU  H'0005'
EID3             EQU  H'0006'
EID4             EQU  H'0007'


;----- C1FLTOBJ1U Bits -----------------------------------------------------
EID5             EQU  H'0000'
EID6             EQU  H'0001'
EID7             EQU  H'0002'
EID8             EQU  H'0003'
EID9             EQU  H'0004'
EID10            EQU  H'0005'
EID11            EQU  H'0006'
EID12            EQU  H'0007'


;----- C1FLTOBJ1T Bits -----------------------------------------------------
EID0             EQU  H'0000'
EID1             EQU  H'0001'
EID2             EQU  H'0002'
EID3             EQU  H'0003'
EID4             EQU  H'0004'
SID11            EQU  H'0005'
EXIDE            EQU  H'0006'
EID13            EQU  H'0000'
EID14            EQU  H'0001'
EID15            EQU  H'0002'
EID16            EQU  H'0003'
EID17            EQU  H'0004'


;----- C1MASK1 Bits -----------------------------------------------------
MSID0            EQU  H'0000'
MSID1            EQU  H'0001'
MSID2            EQU  H'0002'
MSID3            EQU  H'0003'
MSID4            EQU  H'0004'
MSID5            EQU  H'0005'
MSID6            EQU  H'0006'
MSID7            EQU  H'0007'


;----- C1MASK1H Bits -----------------------------------------------------
MSID0            EQU  H'0000'
MSID1            EQU  H'0001'
MSID2            EQU  H'0002'
MEID0            EQU  H'0003'
MEID1            EQU  H'0004'
MEID2            EQU  H'0005'
MEID3            EQU  H'0006'
MEID4            EQU  H'0007'
MSID8            EQU  H'0000'
MSID9            EQU  H'0001'
MSID10           EQU  H'0002'
MEID0            EQU  H'0003'
MEID1            EQU  H'0004'
MEID2            EQU  H'0005'
MEID3            EQU  H'0006'
MEID4            EQU  H'0007'


;----- C1MASK1U Bits -----------------------------------------------------
MEID5            EQU  H'0000'
MEID6            EQU  H'0001'
MEID7            EQU  H'0002'
MEID8            EQU  H'0003'
MEID9            EQU  H'0004'
MEID10           EQU  H'0005'
MEID11           EQU  H'0006'
MEID12           EQU  H'0007'


;----- C1MASK1T Bits -----------------------------------------------------
MEID0            EQU  H'0000'
MEID1            EQU  H'0001'
MEID2            EQU  H'0002'
MEID3            EQU  H'0003'
MEID4            EQU  H'0004'
MSID11           EQU  H'0005'
MIDE             EQU  H'0006'
MEID13           EQU  H'0000'
MEID14           EQU  H'0001'
MEID15           EQU  H'0002'
MEID16           EQU  H'0003'
MEID17           EQU  H'0004'


;----- RA1PPS Bits -----------------------------------------------------
RA1PPS0          EQU  H'0000'
RA1PPS1          EQU  H'0001'
RA1PPS2          EQU  H'0002'
RA1PPS3          EQU  H'0003'
RA1PPS4          EQU  H'0004'
RA1PPS5          EQU  H'0005'


;----- RB1PPS Bits -----------------------------------------------------
RB1PPS0          EQU  H'0000'
RB1PPS1          EQU  H'0001'
RB1PPS2          EQU  H'0002'
RB1PPS3          EQU  H'0003'
RB1PPS4          EQU  H'0004'
RB1PPS5          EQU  H'0005'


;----- RC1PPS Bits -----------------------------------------------------
RC1PPS0          EQU  H'0000'
RC1PPS1          EQU  H'0001'
RC1PPS2          EQU  H'0002'
RC1PPS3          EQU  H'0003'
RC1PPS4          EQU  H'0004'
RC1PPS5          EQU  H'0005'


;----- RD1PPS Bits -----------------------------------------------------
RD1PPS0          EQU  H'0000'
RD1PPS1          EQU  H'0001'
RD1PPS2          EQU  H'0002'
RD1PPS3          EQU  H'0003'
RD1PPS4          EQU  H'0004'
RD1PPS5          EQU  H'0005'


;----- RE1PPS Bits -----------------------------------------------------
RE1PPS0          EQU  H'0000'
RE1PPS1          EQU  H'0001'
RE1PPS2          EQU  H'0002'
RE1PPS3          EQU  H'0003'
RE1PPS4          EQU  H'0004'
RE1PPS5          EQU  H'0005'


;----- INT1PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
INT1PPS0         EQU  H'0000'
INT1PPS1         EQU  H'0001'
INT1PPS2         EQU  H'0002'
INT1PPS3         EQU  H'0003'
INT1PPS4         EQU  H'0004'
INT1PPS0         EQU  H'0000'
INT1PPS1         EQU  H'0001'
INT1PPS2         EQU  H'0002'
INT1PPS3         EQU  H'0003'
INT1PPS4         EQU  H'0004'


;----- T1CKIPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
T1CKIPPS0        EQU  H'0000'
T1CKIPPS1        EQU  H'0001'
T1CKIPPS2        EQU  H'0002'
T1CKIPPS3        EQU  H'0003'
T1CKIPPS4        EQU  H'0004'
T1CKIPPS5        EQU  H'0005'
T1CKIPPS0        EQU  H'0000'
T1CKIPPS1        EQU  H'0001'
T1CKIPPS2        EQU  H'0002'
T1CKIPPS3        EQU  H'0003'
T1CKIPPS4        EQU  H'0004'
T1CKIPPS5        EQU  H'0005'


;----- T1GPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
T1GPPS0          EQU  H'0000'
T1GPPS1          EQU  H'0001'
T1GPPS2          EQU  H'0002'
T1GPPS3          EQU  H'0003'
T1GPPS4          EQU  H'0004'
T1GPPS0          EQU  H'0000'
T1GPPS1          EQU  H'0001'
T1GPPS2          EQU  H'0002'
T1GPPS3          EQU  H'0003'
T1GPPS4          EQU  H'0004'


;----- CCP1PPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PORT2            EQU  H'0005'
CCP1PPS0         EQU  H'0000'
CCP1PPS1         EQU  H'0001'
CCP1PPS2         EQU  H'0002'
CCP1PPS3         EQU  H'0003'
CCP1PPS4         EQU  H'0004'
CCP1PPS5         EQU  H'0005'
CCP1PPS0         EQU  H'0000'
CCP1PPS1         EQU  H'0001'
CCP1PPS2         EQU  H'0002'
CCP1PPS3         EQU  H'0003'
CCP1PPS4         EQU  H'0004'
CCP1PPS5         EQU  H'0005'


;----- PWM1ERSPPS Bits -----------------------------------------------------
PIN0             EQU  H'0000'
PIN1             EQU  H'0001'
PIN2             EQU  H'0002'
PORT0            EQU  H'0003'
PORT1            EQU  H'0004'
PWM1ERSPPS0      EQU  H'0000'
PWM1ERSPPS1      EQU  H'0001'
PWM1ERSPPS2      EQU  H'0002'
PWM1ERSPPS3      EQU  H'0003'
PWM1ERSPPS4      EQU  H'0004'
PWM1ERSPPS0      EQU  H'0000'
PWM1ERSPPS1      EQU  H'0001'
PWM1ERSPPS2      EQU  H'0002'
PWM1ERSPPS3      EQU  H'0003'
PWM1ERSPPS4      EQU  H'0004'


