GreatCowBASIC/DATFileGenerator/incfiles/p18F46Q84.inc
;----- C1RXOVIFU Bits -----------------------------------------------------
RFOVIF16         EQU  H'0000'
RFOVIF17         EQU  H'0001'
RFOVIF18         EQU  H'0002'
RFOVIF19         EQU  H'0003'
RFOVIF20         EQU  H'0004'
RFOVIF21         EQU  H'0005'
RFOVIF22         EQU  H'0006'
RFOVIF23         EQU  H'0007'


;----- C1RXOVIFT Bits -----------------------------------------------------
RFOVIF24         EQU  H'0000'
RFOVIF25         EQU  H'0001'
RFOVIF26         EQU  H'0002'
RFOVIF27         EQU  H'0003'
RFOVIF28         EQU  H'0004'
RFOVIF29         EQU  H'0005'
RFOVIF30         EQU  H'0006'
RFOVIF31         EQU  H'0007'


;----- C1TXATIF Bits -----------------------------------------------------
TFATIF0          EQU  H'0000'
TFATIF1          EQU  H'0001'
TFATIF2          EQU  H'0002'
TFATIF3          EQU  H'0003'
TFATIF4          EQU  H'0004'
TFATIF5          EQU  H'0005'
TFATIF6          EQU  H'0006'
TFATIF7          EQU  H'0007'


;----- C1TXATIFH Bits -----------------------------------------------------
TFATIF8          EQU  H'0000'
TFATIF9          EQU  H'0001'
TFATIF10         EQU  H'0002'
TFATIF11         EQU  H'0003'
TFATIF12         EQU  H'0004'
TFATIF13         EQU  H'0005'
TFATIF14         EQU  H'0006'
TFATIF15         EQU  H'0007'


;----- C1TXATIFU Bits -----------------------------------------------------
TFATIF16         EQU  H'0000'
TFATIF17         EQU  H'0001'
TFATIF18         EQU  H'0002'
TFATIF19         EQU  H'0003'
TFATIF20         EQU  H'0004'
TFATIF21         EQU  H'0005'
TFATIF22         EQU  H'0006'
TFATIF23         EQU  H'0007'


;----- C1TXATIFT Bits -----------------------------------------------------
TFATIF24         EQU  H'0000'
TFATIF25         EQU  H'0001'
TFATIF26         EQU  H'0002'
TFATIF27         EQU  H'0003'
TFATIF28         EQU  H'0004'
TFATIF29         EQU  H'0005'
TFATIF30         EQU  H'0006'
TFATIF31         EQU  H'0007'


;----- C1TXREQ Bits -----------------------------------------------------
TXREQ0           EQU  H'0000'
TXREQ1           EQU  H'0001'
TXREQ2           EQU  H'0002'
TXREQ3           EQU  H'0003'
TXREQ4           EQU  H'0004'
TXREQ5           EQU  H'0005'
TXREQ6           EQU  H'0006'
TXREQ7           EQU  H'0007'


;----- C1TXREQH Bits -----------------------------------------------------
TXREQ8           EQU  H'0000'
TXREQ9           EQU  H'0001'
TXREQ10          EQU  H'0002'
TXREQ11          EQU  H'0003'
TXREQ12          EQU  H'0004'
TXREQ13          EQU  H'0005'
TXREQ14          EQU  H'0006'
TXREQ15          EQU  H'0007'


;----- C1TXREQU Bits -----------------------------------------------------
TXREQ16          EQU  H'0000'
TXREQ17          EQU  H'0001'
TXREQ18          EQU  H'0002'
TXREQ19          EQU  H'0003'
TXREQ20          EQU  H'0004'
TXREQ21          EQU  H'0005'
TXREQ22          EQU  H'0006'
TXREQ23          EQU  H'0007'


;----- C1TXREQT Bits -----------------------------------------------------
TXREQ24          EQU  H'0000'
TXREQ25          EQU  H'0001'
TXREQ26          EQU  H'0002'
TXREQ27          EQU  H'0003'
TXREQ28          EQU  H'0004'
TXREQ29          EQU  H'0005'
TXREQ30          EQU  H'0006'
TXREQ31          EQU  H'0007'


;----- C1TRECL Bits -----------------------------------------------------
RERRCNT0         EQU  H'0000'
RERRCNT1         EQU  H'0001'
RERRCNT2         EQU  H'0002'
RERRCNT3         EQU  H'0003'
RERRCNT4         EQU  H'0004'
RERRCNT5         EQU  H'0005'
RERRCNT6         EQU  H'0006'
RERRCNT7         EQU  H'0007'


;----- C1TRECH Bits -----------------------------------------------------
TERRCNT0         EQU  H'0000'
TERRCNT1         EQU  H'0001'
TERRCNT2         EQU  H'0002'
TERRCNT3         EQU  H'0003'
TERRCNT4         EQU  H'0004'
TERRCNT5         EQU  H'0005'
TERRCNT6         EQU  H'0006'
TERRCNT7         EQU  H'0007'


;----- C1TRECU Bits -----------------------------------------------------
EWARN            EQU  H'0000'
RXWARN           EQU  H'0001'
TXWARN           EQU  H'0002'
RXBP             EQU  H'0003'
TXBP             EQU  H'0004'
TXBO             EQU  H'0005'


;----- C1BDIAG0L Bits -----------------------------------------------------
NRERRCNT0        EQU  H'0000'
NRERRCNT1        EQU  H'0001'
NRERRCNT2        EQU  H'0002'
NRERRCNT3        EQU  H'0003'
NRERRCNT4        EQU  H'0004'
NRERRCNT5        EQU  H'0005'
NRERRCNT6        EQU  H'0006'
NRERRCNT7        EQU  H'0007'


;----- C1BDIAG0H Bits -----------------------------------------------------
NTERRCNT0        EQU  H'0000'
NTERRCNT1        EQU  H'0001'
NTERRCNT2        EQU  H'0002'
NTERRCNT3        EQU  H'0003'
NTERRCNT4        EQU  H'0004'
NTERRCNT5        EQU  H'0005'
NTERRCNT6        EQU  H'0006'
NTERRCNT7        EQU  H'0007'


;----- C1BDIAG0U Bits -----------------------------------------------------
DRERRCNT0        EQU  H'0000'
DRERRCNT1        EQU  H'0001'
DRERRCNT2        EQU  H'0002'
DRERRCNT3        EQU  H'0003'
DRERRCNT4        EQU  H'0004'
DRERRCNT5        EQU  H'0005'
DRERRCNT6        EQU  H'0006'
DRERRCNT7        EQU  H'0007'


;----- C1BDIAG0T Bits -----------------------------------------------------
DTERRCNT0        EQU  H'0000'
DTERRCNT1        EQU  H'0001'
DTERRCNT2        EQU  H'0002'
DTERRCNT3        EQU  H'0003'
DTERRCNT4        EQU  H'0004'
DTERRCNT5        EQU  H'0005'
DTERRCNT6        EQU  H'0006'
DTERRCNT7        EQU  H'0007'


;----- C1BDIAG1L Bits -----------------------------------------------------
EFMSGCNT0        EQU  H'0000'
EFMSGCNT1        EQU  H'0001'
EFMSGCNT2        EQU  H'0002'
EFMSGCNT3        EQU  H'0003'
EFMSGCNT4        EQU  H'0004'
EFMSGCNT5        EQU  H'0005'
EFMSGCNT6        EQU  H'0006'
EFMSGCNT7        EQU  H'0007'


;----- C1BDIAG1H Bits -----------------------------------------------------
EFMSGCNT8        EQU  H'0000'
EFMSGCNT9        EQU  H'0001'
EFMSGCNT10       EQU  H'0002'
EFMSGCNT11       EQU  H'0003'
EFMSGCNT12       EQU  H'0004'
EFMSGCNT13       EQU  H'0005'
EFMSGCNT14       EQU  H'0006'
EFMSGCNT15       EQU  H'0007'


;----- C1BDIAG1U Bits -----------------------------------------------------
NBIT0ERR         EQU  H'0000'
NBIT1ERR         EQU  H'0001'
NACKERR          EQU  H'0002'
NFORMERR         EQU  H'0003'
NSTUFERR         EQU  H'0004'
NCRCERR          EQU  H'0005'
TXBOERR          EQU  H'0007'


