GreatCowBASIC/DATFileGenerator/incfiles/p18F46Q84.inc
;----- C1FIFOUA2 Bits -----------------------------------------------------
FIFOUA0          EQU  H'0000'
FIFOUA1          EQU  H'0001'
FIFOUA2          EQU  H'0002'
FIFOUA3          EQU  H'0003'
FIFOUA4          EQU  H'0004'
FIFOUA5          EQU  H'0005'
FIFOUA6          EQU  H'0006'
FIFOUA7          EQU  H'0007'


;----- C1FIFOUA2H Bits -----------------------------------------------------
FIFOUA8          EQU  H'0000'
FIFOUA9          EQU  H'0001'
FIFOUA10         EQU  H'0002'
FIFOUA11         EQU  H'0003'
FIFOUA12         EQU  H'0004'
FIFOUA13         EQU  H'0005'
FIFOUA14         EQU  H'0006'
FIFOUA15         EQU  H'0007'


;----- C1FIFOUA2U Bits -----------------------------------------------------
FIFOUA16         EQU  H'0000'
FIFOUA17         EQU  H'0001'
FIFOUA18         EQU  H'0002'
FIFOUA19         EQU  H'0003'
FIFOUA20         EQU  H'0004'
FIFOUA21         EQU  H'0005'
FIFOUA22         EQU  H'0006'
FIFOUA23         EQU  H'0007'


;----- C1FIFOUA2T Bits -----------------------------------------------------
FIFOUA24         EQU  H'0000'
FIFOUA25         EQU  H'0001'
FIFOUA26         EQU  H'0002'
FIFOUA27         EQU  H'0003'
FIFOUA28         EQU  H'0004'
FIFOUA29         EQU  H'0005'
FIFOUA30         EQU  H'0006'
FIFOUA31         EQU  H'0007'


;----- C1FIFOCON3 Bits -----------------------------------------------------
TFNRFNIE         EQU  H'0000'
TFHRFHIE         EQU  H'0001'
TFERFFIE         EQU  H'0002'
RXOVIE           EQU  H'0003'
TXATIE           EQU  H'0004'
RXTSEN           EQU  H'0005'
RTREN            EQU  H'0006'
TXEN             EQU  H'0007'


;----- C1FIFOCON3H Bits -----------------------------------------------------
UINC             EQU  H'0000'
TXREQ            EQU  H'0001'
FRESET           EQU  H'0002'


;----- C1FIFOCON3U Bits -----------------------------------------------------
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'
TXPRI0           EQU  H'0000'
TXPRI1           EQU  H'0001'
TXPRI2           EQU  H'0002'
TXPRI3           EQU  H'0003'
TXPRI4           EQU  H'0004'
TXAT0            EQU  H'0005'
TXAT1            EQU  H'0006'


;----- C1FIFOCON3T Bits -----------------------------------------------------
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'
PLSIZE0          EQU  H'0005'
PLSIZE1          EQU  H'0006'
PLSIZE2          EQU  H'0007'
FSIZE0           EQU  H'0000'
FSIZE1           EQU  H'0001'
FSIZE2           EQU  H'0002'
FSIZE3           EQU  H'0003'
FSIZE4           EQU  H'0004'
PLSIZE0          EQU  H'0005'
PLSIZE1          EQU  H'0006'
PLSIZE2          EQU  H'0007'


;----- C1FIFOSTA3 Bits -----------------------------------------------------
TFNRFNIF         EQU  H'0000'
TFHRFHIF         EQU  H'0001'
TFERFFIF         EQU  H'0002'
RXOVIF           EQU  H'0003'
TXATIF           EQU  H'0004'
TXERR            EQU  H'0005'
TXLARB           EQU  H'0006'
TXABT            EQU  H'0007'


;----- C1FIFOSTA3H Bits -----------------------------------------------------
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'
FIFOCI0          EQU  H'0000'
FIFOCI1          EQU  H'0001'
FIFOCI2          EQU  H'0002'
FIFOCI3          EQU  H'0003'
FIFOCI4          EQU  H'0004'


;----- C1FIFOUA3 Bits -----------------------------------------------------
FIFOUA0          EQU  H'0000'
FIFOUA1          EQU  H'0001'
FIFOUA2          EQU  H'0002'
FIFOUA3          EQU  H'0003'
FIFOUA4          EQU  H'0004'
FIFOUA5          EQU  H'0005'
FIFOUA6          EQU  H'0006'
FIFOUA7          EQU  H'0007'


;----- C1FIFOUA3H Bits -----------------------------------------------------
FIFOUA8          EQU  H'0000'
FIFOUA9          EQU  H'0001'
FIFOUA10         EQU  H'0002'
FIFOUA11         EQU  H'0003'
FIFOUA12         EQU  H'0004'
FIFOUA13         EQU  H'0005'
FIFOUA14         EQU  H'0006'
FIFOUA15         EQU  H'0007'


;----- C1FIFOUA3U Bits -----------------------------------------------------
FIFOUA16         EQU  H'0000'
FIFOUA17         EQU  H'0001'
FIFOUA18         EQU  H'0002'
FIFOUA19         EQU  H'0003'
FIFOUA20         EQU  H'0004'
FIFOUA21         EQU  H'0005'
FIFOUA22         EQU  H'0006'
FIFOUA23         EQU  H'0007'


;----- C1FIFOUA3T Bits -----------------------------------------------------
FIFOUA24         EQU  H'0000'
FIFOUA25         EQU  H'0001'
FIFOUA26         EQU  H'0002'
FIFOUA27         EQU  H'0003'
FIFOUA28         EQU  H'0004'
FIFOUA29         EQU  H'0005'
FIFOUA30         EQU  H'0006'
FIFOUA31         EQU  H'0007'


;----- C1FLTCON0L Bits -----------------------------------------------------
F0BP0            EQU  H'0000'
F0BP1            EQU  H'0001'
F0BP2            EQU  H'0002'
F0BP3            EQU  H'0003'
F0BP4            EQU  H'0004'
FLTEN0           EQU  H'0007'
F0BP0            EQU  H'0000'
F0BP1            EQU  H'0001'
F0BP2            EQU  H'0002'
F0BP3            EQU  H'0003'
F0BP4            EQU  H'0004'


;----- C1FLTCON0H Bits -----------------------------------------------------
F1BP0            EQU  H'0000'
F1BP1            EQU  H'0001'
F1BP2            EQU  H'0002'
F1BP3            EQU  H'0003'
F1BP4            EQU  H'0004'
FLTEN1           EQU  H'0007'
F1BP0            EQU  H'0000'
F1BP1            EQU  H'0001'
F1BP2            EQU  H'0002'
F1BP3            EQU  H'0003'
F1BP4            EQU  H'0004'


;----- C1FLTCON0U Bits -----------------------------------------------------
F2BP0            EQU  H'0000'
F2BP1            EQU  H'0001'
F2BP2            EQU  H'0002'
F2BP3            EQU  H'0003'
F2BP4            EQU  H'0004'
FLTEN2           EQU  H'0007'
F2BP0            EQU  H'0000'
F2BP1            EQU  H'0001'
F2BP2            EQU  H'0002'
F2BP3            EQU  H'0003'
F2BP4            EQU  H'0004'


;----- C1FLTCON0T Bits -----------------------------------------------------
F3BP0            EQU  H'0000'
F3BP1            EQU  H'0001'
F3BP2            EQU  H'0002'
F3BP3            EQU  H'0003'
F3BP4            EQU  H'0004'
FLTEN3           EQU  H'0007'
F3BP0            EQU  H'0000'
F3BP1            EQU  H'0001'
F3BP2            EQU  H'0002'
F3BP3            EQU  H'0003'
F3BP4            EQU  H'0004'


;----- C1FLTCON2L Bits -----------------------------------------------------
F8BP0            EQU  H'0000'
F8BP1            EQU  H'0001'
F8BP2            EQU  H'0002'
F8BP3            EQU  H'0003'
F8BP4            EQU  H'0004'
FLTEN8           EQU  H'0007'
F8BP0            EQU  H'0000'
F8BP1            EQU  H'0001'
F8BP2            EQU  H'0002'
F8BP3            EQU  H'0003'
F8BP4            EQU  H'0004'


;----- C1FLTCON2H Bits -----------------------------------------------------
F9BP0            EQU  H'0000'
F9BP1            EQU  H'0001'
F9BP2            EQU  H'0002'
F9BP3            EQU  H'0003'
F9BP4            EQU  H'0004'
FLTEN9           EQU  H'0007'
F9BP0            EQU  H'0000'
F9BP1            EQU  H'0001'
F9BP2            EQU  H'0002'
F9BP3            EQU  H'0003'
F9BP4            EQU  H'0004'


;----- C1FLTCON2U Bits -----------------------------------------------------
F10BP0           EQU  H'0000'
F10BP1           EQU  H'0001'
F10BP2           EQU  H'0002'
F10BP3           EQU  H'0003'
F10BP4           EQU  H'0004'
FLTEN10          EQU  H'0007'
F10BP0           EQU  H'0000'
F10BP1           EQU  H'0001'
F10BP2           EQU  H'0002'
F10BP3           EQU  H'0003'
F10BP4           EQU  H'0004'


;----- C1FLTCON2T Bits -----------------------------------------------------
F11BP0           EQU  H'0000'
F11BP1           EQU  H'0001'
F11BP2           EQU  H'0002'
F11BP3           EQU  H'0003'
F11BP4           EQU  H'0004'
FLTEN11          EQU  H'0007'
F11BP0           EQU  H'0000'
F11BP1           EQU  H'0001'
F11BP2           EQU  H'0002'
F11BP3           EQU  H'0003'
F11BP4           EQU  H'0004'


;----- C1FLTOBJ0 Bits -----------------------------------------------------
SID0             EQU  H'0000'
SID1             EQU  H'0001'
SID2             EQU  H'0002'
SID3             EQU  H'0003'
SID4             EQU  H'0004'
SID5             EQU  H'0005'
SID6             EQU  H'0006'
SID7             EQU  H'0007'


;----- C1FLTOBJ0H Bits -----------------------------------------------------
SID0             EQU  H'0000'
SID1             EQU  H'0001'
SID2             EQU  H'0002'
EID0             EQU  H'0003'
EID1             EQU  H'0004'
EID2             EQU  H'0005'
EID3             EQU  H'0006'
EID4             EQU  H'0007'
SID8             EQU  H'0000'
SID9             EQU  H'0001'
SID10            EQU  H'0002'
EID0             EQU  H'0003'
EID1             EQU  H'0004'
EID2             EQU  H'0005'
EID3             EQU  H'0006'
EID4             EQU  H'0007'


