GreatCowBASIC/DATFileGenerator/incfiles/p18F46Q84.inc
;----- TU16APS Bits -----------------------------------------------------
PS0              EQU  H'0000'
PS1              EQU  H'0001'
PS2              EQU  H'0002'
PS3              EQU  H'0003'
PS4              EQU  H'0004'
PS5              EQU  H'0005'
PS6              EQU  H'0006'
PS7              EQU  H'0007'
TU16APS0         EQU  H'0000'
TU16APS1         EQU  H'0001'
TU16APS2         EQU  H'0002'
TU16APS3         EQU  H'0003'
TU16APS4         EQU  H'0004'
TU16APS5         EQU  H'0005'
TU16APS6         EQU  H'0006'
TU16APS7         EQU  H'0007'


;----- TU16ATMR Bits -----------------------------------------------------
TMRL0            EQU  H'0000'
TMRL1            EQU  H'0001'
TMRL2            EQU  H'0002'
TMRL3            EQU  H'0003'
TMRL4            EQU  H'0004'
TMRL5            EQU  H'0005'
TMRL6            EQU  H'0006'
TMRL7            EQU  H'0007'
TU16ATMRL0       EQU  H'0000'
TU16ATMRL1       EQU  H'0001'
TU16ATMRL2       EQU  H'0002'
TU16ATMRL3       EQU  H'0003'
TU16ATMRL4       EQU  H'0004'
TU16ATMRL5       EQU  H'0005'
TU16ATMRL6       EQU  H'0006'
TU16ATMRL7       EQU  H'0007'
TU16ATMR0        EQU  H'0000'
TU16ATMR1        EQU  H'0001'
TU16ATMR2        EQU  H'0002'
TU16ATMR3        EQU  H'0003'
TU16ATMR4        EQU  H'0004'
TU16ATMR5        EQU  H'0005'
TU16ATMR6        EQU  H'0006'
TU16ATMR7        EQU  H'0007'
CRL0             EQU  H'0000'
CRL1             EQU  H'0001'
CRL2             EQU  H'0002'
CRL3             EQU  H'0003'
CRL4             EQU  H'0004'
CRL5             EQU  H'0005'
CRL6             EQU  H'0006'
CRL7             EQU  H'0007'
TU16ACRL0        EQU  H'0000'
TU16ACRL1        EQU  H'0001'
TU16ACRL2        EQU  H'0002'
TU16ACRL3        EQU  H'0003'
TU16ACRL4        EQU  H'0004'
TU16ACRL5        EQU  H'0005'
TU16ACRL6        EQU  H'0006'
TU16ACRL7        EQU  H'0007'
TU16ACR0         EQU  H'0000'
TU16ACR1         EQU  H'0001'
TU16ACR2         EQU  H'0002'
TU16ACR3         EQU  H'0003'
TU16ACR4         EQU  H'0004'
TU16ACR5         EQU  H'0005'
TU16ACR6         EQU  H'0006'
TU16ACR7         EQU  H'0007'


;----- TU16ATMRH Bits -----------------------------------------------------
TMRH0            EQU  H'0000'
TMRH1            EQU  H'0001'
TMRH2            EQU  H'0002'
TMRH3            EQU  H'0003'
TMRH4            EQU  H'0004'
TMRH5            EQU  H'0005'
TMRH6            EQU  H'0006'
TMRH7            EQU  H'0007'
TU16ATMRH0       EQU  H'0000'
TU16ATMRH1       EQU  H'0001'
TU16ATMRH2       EQU  H'0002'
TU16ATMRH3       EQU  H'0003'
TU16ATMRH4       EQU  H'0004'
TU16ATMRH5       EQU  H'0005'
TU16ATMRH6       EQU  H'0006'
TU16ATMRH7       EQU  H'0007'
TU16ATMR8        EQU  H'0000'
TU16ATMR9        EQU  H'0001'
TU16ATMR10       EQU  H'0002'
TU16ATMR11       EQU  H'0003'
TU16ATMR12       EQU  H'0004'
TU16ATMR13       EQU  H'0005'
TU16ATMR14       EQU  H'0006'
TU16ATMR15       EQU  H'0007'
CRH0             EQU  H'0000'
CRH1             EQU  H'0001'
CRH2             EQU  H'0002'
CRH3             EQU  H'0003'
CRH4             EQU  H'0004'
CRH5             EQU  H'0005'
CRH6             EQU  H'0006'
CRH7             EQU  H'0007'
TU16ACRH0        EQU  H'0000'
TU16ACRH1        EQU  H'0001'
TU16ACRH2        EQU  H'0002'
TU16ACRH3        EQU  H'0003'
TU16ACRH4        EQU  H'0004'
TU16ACRH5        EQU  H'0005'
TU16ACRH6        EQU  H'0006'
TU16ACRH7        EQU  H'0007'
TU16ACR8         EQU  H'0000'
TU16ACR9         EQU  H'0001'
TU16ACR10        EQU  H'0002'
TU16ACR11        EQU  H'0003'
TU16ACR12        EQU  H'0004'
TU16ACR13        EQU  H'0005'
TU16ACR14        EQU  H'0006'
TU16ACR15        EQU  H'0007'


;----- TU16APR Bits -----------------------------------------------------
PRL0             EQU  H'0000'
PRL1             EQU  H'0001'
PRL2             EQU  H'0002'
PRL3             EQU  H'0003'
PRL4             EQU  H'0004'
PRL5             EQU  H'0005'
PRL6             EQU  H'0006'
PRL7             EQU  H'0007'
TU16APRL0        EQU  H'0000'
TU16APRL1        EQU  H'0001'
TU16APRL2        EQU  H'0002'
TU16APRL3        EQU  H'0003'
TU16APRL4        EQU  H'0004'
TU16APRL5        EQU  H'0005'
TU16APRL6        EQU  H'0006'
TU16APRL7        EQU  H'0007'
TU16APR0         EQU  H'0000'
TU16APR1         EQU  H'0001'
TU16APR2         EQU  H'0002'
TU16APR3         EQU  H'0003'
TU16APR4         EQU  H'0004'
TU16APR5         EQU  H'0005'
TU16APR6         EQU  H'0006'
TU16APR7         EQU  H'0007'


;----- TU16APRH Bits -----------------------------------------------------
PRH0             EQU  H'0000'
PRH1             EQU  H'0001'
PRH2             EQU  H'0002'
PRH3             EQU  H'0003'
PRH4             EQU  H'0004'
PRH5             EQU  H'0005'
PRH6             EQU  H'0006'
PRH7             EQU  H'0007'
TU16APRH0        EQU  H'0000'
TU16APRH1        EQU  H'0001'
TU16APRH2        EQU  H'0002'
TU16APRH3        EQU  H'0003'
TU16APRH4        EQU  H'0004'
TU16APRH5        EQU  H'0005'
TU16APRH6        EQU  H'0006'
TU16APRH7        EQU  H'0007'
TU16APR8         EQU  H'0000'
TU16APR9         EQU  H'0001'
TU16APR10        EQU  H'0002'
TU16APR11        EQU  H'0003'
TU16APR12        EQU  H'0004'
TU16APR13        EQU  H'0005'
TU16APR14        EQU  H'0006'
TU16APR15        EQU  H'0007'


;----- TU16ACLK Bits -----------------------------------------------------
CLK0             EQU  H'0000'
CLK1             EQU  H'0001'
CLK2             EQU  H'0002'
CLK3             EQU  H'0003'
CLK4             EQU  H'0004'
TU16ACLK0        EQU  H'0000'
TU16ACLK1        EQU  H'0001'
TU16ACLK2        EQU  H'0002'
TU16ACLK3        EQU  H'0003'
TU16ACLK4        EQU  H'0004'


;----- TU16AERS Bits -----------------------------------------------------
ERS0             EQU  H'0000'
ERS1             EQU  H'0001'
ERS2             EQU  H'0002'
ERS3             EQU  H'0003'
ERS4             EQU  H'0004'
ERS5             EQU  H'0005'
TU16AERS0        EQU  H'0000'
TU16AERS1        EQU  H'0001'
TU16AERS2        EQU  H'0002'
TU16AERS3        EQU  H'0003'
TU16AERS4        EQU  H'0004'
TU16AERS5        EQU  H'0005'


;----- TU16BCON0 Bits -----------------------------------------------------
CIE              EQU  H'0000'
ZIE              EQU  H'0001'
PRIE             EQU  H'0002'
RDSEL            EQU  H'0003'
OPOL             EQU  H'0004'
OM               EQU  H'0005'
CPOL             EQU  H'0006'
ON_TU16BCON0     EQU  H'0007'
TU16BCIE         EQU  H'0000'
TU16BZIE         EQU  H'0001'
TU16BPRIE        EQU  H'0002'
TU16BRDSEL       EQU  H'0003'
TU16BOPOL        EQU  H'0004'
TU16BOM          EQU  H'0005'
TU16BCPOL        EQU  H'0006'
TU16BON          EQU  H'0007'


